# ViewShapeBuilder Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewShapeBuilder Constructor
ViewShapeBuilder Class See Also
---
Default constructor for an ViewShapeBuilder object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ViewShapeBuilder()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ViewShapeBuilder()
```

# See Also
ViewShapeBuilder Class
ViewShapeBuilder Overload
Autodesk.Revit.DB Namespace